test/lbm1Foam/wallLBM/0/f_0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topWall
    {
        type            empty;
    }
    bottomWall
    {
        type            empty;
    }
    rightWall
    {
        type            fixedValue;
        value           #codeStream
        {
          codeInclude
          #{
              #include "fvCFD.H"
          #};

          codeOptions
          #{
              -I$(LIB_SRC)/finiteVolume/lnInclude \
              -I$(LIB_SRC)/meshTools/lnInclude
          #};

          codeLibs
          #{
              -lmeshTools \
              -lfiniteVolume
          #};

          code
          #{
                const IOdictionary& d = static_cast<const IOdictionary&>
                (
                  dict.parent().parent()
                );

                const fvMesh& mesh = refCast<const fvMesh>(d.db());
                const label id = mesh.boundary().findPatchID("rightWall");
                const fvPatch& patch = mesh.boundary()[id];

                // initialize field
                scalarField f_0(patch.size(), scalar(0.));

                forAll(f_0, fI)
                {
                  f_0[fI] =
                }


          #};
        };
    }
    leftWall
    {
        type            fixedValue;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
