test/lbm1Foam/wallLBM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
     (-5   0   0)
     ( 5   0   0)
     ( 5   1   0)
     (-5   1   0)
     (-5   0   1)
     ( 5   0   1)
     ( 5   1   1)
     (-5   1   1)
);

blocks
(
     hex (0 1 2 3 4 5 6 7)          (1000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topWall
    {
      type empty;
      faces
      (
          (4 5 6 7)
      );
    }

    bottomWall
    {
      type empty;
      faces
      (
          (0 1 2 3)
      );
    }

    rightWall
    {
      type wall;
      faces
      (
          (1 2 5 6)
      );
    }

    leftWall
    {
      type wall;
      faces
      (
          (0 3 7 4)
      );
    }

    frontAndBack
    {
      type empty;
      faces
      (
            (3 2 6 7)
  		      (0 1 5 4)
      );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
