test/lbm1Foam/wallLBM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	lbm1Foam;

startFrom       	startTime;

startTime       	0;

stopAt          	endTime;

endTime         	1;

deltaX				    0.01;

deltaT          	0.00001;

writeControl    	timeStep;

writeInterval   	5000;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

//runTimeModifiable 	no;

//adjustTimeStep  	no;

//maxCo           	5;

directions 			3;

density				1000; // [kg/m3]

pressure			1e5; // [Pa]

//internal			2;

initTol				1e-12;

initIterMax 		1e3;

initUfactor			1;


// ************************************************************************* //
