test/lbm1Foam/wallLBM/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
  volVectorFieldValue U (1.75 0 0)
	volScalarFieldValue f_0 0
	volScalarFieldValue f_1 0
	volScalarFieldValue f_2 0
);

regions
(
    boxToCell
    {
        box (-2.25 -1.1 -1.1) (-1.75 1.1 1.1);
        fieldValues
        (
			       volVectorFieldValue U (1.9 0 0)
        );
    }
/*    boxToCell
    {
        box (-3.5 -1.1 -1.1) (-3 1.1 1.1);
        fieldValues
        (
			       volVectorFieldValue U (1 0 0)
        );
    }
    boxToCell
    {
        box (-3 -1.1 -1.1) (-2.5 1.1 1.1);
        fieldValues
        (
			       volVectorFieldValue U (0.75 0 0)
        );
    }
    boxToCell
    {
        box (-2.5 -1.1 -1.1) (-2 1.1 1.1);
        fieldValues
        (
			       volVectorFieldValue U (0.5 0 0)
        );
    }*/
);


// ************************************************************************* //
